Repository: LJAMINE/stock_scanner_agriwise
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

source: Parametre Page
ar: صفحة الإعدادات
fr: Page Paramètre

source: Scan Mode
ar: وضع المسح
fr: Mode de scan

source: Language
ar: اللغة
fr: Langue

source: Change
ar: تغيير
fr: Changer

source: Not set
ar: غير محدد
fr: Non défini

source: Camera scanner
ar: ماسح الكاميرا
fr: Scanner caméra

source: Hardware Scanner
ar: ماسح الأجهزة
fr: Scanner matériel

source: Select scan mode
ar: اختر وضع المسح
fr: Sélectionner le mode de scan

source: Use Camera
ar: استخدم الكاميرا
fr: Utiliser la caméra

source: Use Hardware Scanner
ar: استخدم ماسح الأجهزة
fr: Utiliser le scanner matériel

source: Scan Items
ar: مسح العناصر
fr: Scanner Articles

source: Start Scan
ar: بدء المسح
fr: Démarrer Scan

source: Stop Scan
ar: إيقاف المسح
fr: Arrêter Scan

source: Save Batch
ar: حفظ الدفعة
fr: Sauvegarder Lot

source: Code
ar: الكود

source: Label
ar: التسمية
fr: Libellé

source: Quantity
ar: الكمية
fr: Quantité

# modifyQuantity
source: modify quantity for
ar: تعديل الكمية لـ
fr: modifier la quantité pour

source: Cancel
ar: إلغاء
fr: Annuler

source: Save
ar: حفظ
fr: Sauvegarder

# enterQuantity
source: Enter quantity (e.g., 1.5 or 1,5)
ar: أدخل الكمية (مثال: 1.5 أو 1,5)
fr: Entrez la quantité (ex: 1,5 ou 1.5)

# enterValidQuantity
source: Please enter a valid positive number
ar: يرجى إدخال رقم موجب صحيح
fr: Veuillez entrer un nombre positif valide

source: Batch saved successfully!
ar: تم حفظ الدفعة بنجاح!
fr: Lot sauvegardé avec succès!

source: Archive History
ar: تاريخ الأرشيف
fr: Historique Archives

source: Loading Archive...
ar: تحميل الأرشيف...
fr: Chargement Archive...

source: No Archive Yet
ar: لا يوجد أرشيف بعد
fr: Pas d'Archive Encore

# archivedBatchesDescription
source: Your archived batches will appear here after scanning and saving items
ar: ستظهر دفعاتك المؤرشفة هنا بعد مسح وحفظ العناصر
fr: Vos lots archivés apparaîtront ici après avoir scanné et sauvegardé des articles

# startScanningTip
source: Start scanning to create your first batch
ar: ابدأ المسح لإنشاء دفعتك الأولى
fr: Commencez à scanner pour créer votre premier lot

source: saved batches
ar: دفعات محفوظة
fr: lots sauvegardés

source: items
ar: عناصر
fr: articles

source: Batch
ar: دفعة
fr: Lot

source: Export Batch
ar: تصدير الدفعة
fr: Exporter Lot

source: View Details
ar: عرض التفاصيل
fr: Voir Détails

source: Batch Details
ar: تفاصيل الدفعة
fr: Détails du Lot

# itemsInBatch
source: Items in this batch:
ar: العناصر في هذه الدفعة:
fr: Articles dans ce lot:

source: Export Complete
ar: اكتمل التصدير
fr: Export Terminé

source: exported successfully
ar: تم التصدير بنجاح
fr: exporté avec succès

source: Open File
ar: فتح الملف
fr: Ouvrir Fichier

# openExcelFile
source: Open the Excel file
ar: فتح ملف Excel
fr: Ouvrir le fichier Excel

source: Save to Downloads
ar: حفظ في التنزيلات
fr: Sauvegarder dans Téléchargements

source: Choose location to save
ar: اختر مكان الحفظ
fr: Choisir l'emplacement de sauvegarde

source: Share
ar: مشاركة
fr: Partager

source: Share with others
ar: مشاركة مع الآخرين
fr: Partager avec d'autres

# selectFolderToSave
source: Select folder to save Excel file
ar: اختر مجلد لحفظ ملف Excel
fr: Sélectionner le dossier pour sauvegarder le fichier Excel

source: File saved to:
ar: تم حفظ الملف في:
fr: Fichier sauvegardé dans:

source: File save cancelled
ar: تم إلغاء حفظ الملف
fr: Sauvegarde du fichier annulée

source: Save failed:
ar: فشل الحفظ:
fr: Sauvegarde échouée:

source: Export failed:
ar: فشل التصدير:
fr: Export échoué:

source: Share failed:
ar: فشلت المشاركة:
fr: Partage échoué:

source: Exporting
ar: جاري التصدير
fr: Export en cours

# importExcel
source: import excel or manually
ar: استيراد excel أو يدوياً
fr: importer excel ou manuellement

source: Choose Excel File
ar: اختر ملف Excel
fr: Choisir Fichier Excel

source: Item not found:
ar: العنصر غير موجود:
fr: Article non trouvé:

source: Edit Item
ar: تعديل العنصر
fr: Modifier Article

# enterValidLabelAndQuantity
source: Please enter a valid label and positive quantity
ar: يرجى إدخال تسمية صحيحة وكمية موجبة
fr: Veuillez entrer un libellé valide et une quantité positive

source: Scan
ar: مسح

source: Archive
ar: أرشيف

source: Settings
ar: إعدادات
fr: Paramètres

source: Add Item manually
ar: إضافة عنصر يدوياً
fr: Ajouter un article manuellement

source: Add
ar: إضافة
fr: Ajouter

source: Add items manually
ar: إضافة عناصر يدوياً
fr: Ajouter des articles manuellement

# importedItems
source: Imported {count} items!
ar: تم استيراد {count} عناصر!
fr: {count} articles importés!

source: Profile
ar: الملف الشخصي
fr: Profil

# scanModePrefix
source: scan mode:
ar: وضع المسح:
fr: mode de scan:

source: Default Profile
ar: الملف الافتراضي
fr: Profil par défaut

# profileEmail
source: profile@stock.scanner
fr: profil@stock.scanner
